(function() {

var rules = [
    [/(\S+? M) .-S-. (\S+? F)/g, '부인'],
    [/(\S+? F) .-S-. (\S+? M)/g, '남편'],
    [/(\S+? M) .-S-. \S+? F <-C-- (\S+? M)/g, '장인'],
    [/(\S+? M) .-S-. \S+? F <-C-- (\S+? F)/g, '장모'],
    [/(\S+? F) .-S-. \S+? M <-C-- (\S+? M)/g, '시부'],
    [/(\S+? F) .-S-. \S+? M <-C-- (\S+? F)/g, '시모'],

    [/(\S+? M) <-C-- \S+? . --C-> (\S+? M)/g, '형제'],
    [/(\S+? M) <-C-- \S+? . --C-> (\S+? F)/g, '남매'],
    [/(\S+? F) <-C-- \S+? . --C-> (\S+? M)/g, '남매'],
    [/(\S+? F) <-C-- \S+? . --C-> (\S+? F)/g, '자매'],

    [/(\S+? .) <-C-- \S+? . --C-> \S+? . --C-> (\S+? .)/g, '조카'],
    [/(\S+? .) <-C-- \S+? . --C-> \S+? . --C-> \S+? . .-S-. (\S+? M)/g, '조카사위'],
    [/(\S+? .) <-C-- \S+? . --C-> \S+? . --C-> \S+? . .-S-. (\S+? F)/g, '조카며느리'],

    [/(\S+? .) --C-> \S+? . .-S-. \S+? . <-C-- (\S+? .)/g, '사돈'],
    [/(\S+? M) .-S-. \S+? . <-C-- \S+? . --C-> \S+? . .-S-. (\S+? M)/g, '동서'],
    [/(\S+? F) .-S-. \S+? . <-C-- \S+? . --C-> \S+? . .-S-. (\S+? F)/g, '동서'],

    [/(\S+? .) --C-> (\S+? M)/g, '아들'],
    [/(\S+? .) --C-> \S+? M .-S-. (\S+? F)/g, '며느리'],
    [/(\S+? .) --C-> (\S+? F)/g, '딸'],
    [/(\S+? .) --C-> \S+? F .-S-. (\S+? M)/g, '사위'],
    [/(\S+? .) --C-> \S+? M --C-> (\S+? M)/g, '손자'],
    [/(\S+? .) --C-> \S+? M --C-> (\S+? F)/g, '손녀'],
    [/(\S+? .) --C-> \S+? F --C-> (\S+? M)/g, '외손자'],
    [/(\S+? .) --C-> \S+? F --C-> (\S+? F)/g, '외손녀'],
    [/(\S+? .) --C-> \S+? M --C-> \S+? . .-S-. (\S+? F)/g, '손자며느리'],
    [/(\S+? .) --C-> \S+? M --C-> \S+? . .-S-. (\S+? M)/g, '손녀사위'],
    [/(\S+? .) --C-> \S+? F --C-> \S+? . .-S-. (\S+? F)/g, '외손자며느리'],
    [/(\S+? .) --C-> \S+? F --C-> \S+? . .-S-. (\S+? M)/g, '외손녀사위'],
    [/(\S+? .) --C-> \S+? M --C-> \S+? M --C-> (\S+? M)/g, '증손자'],
    [/(\S+? .) --C-> \S+? M --C-> \S+? M --C-> (\S+? F)/g, '증손녀'],
    [/(\S+? .) --C-> \S+? F --C-> \S+? M --C-> (\S+? M)/g, '외증손자'],
    [/(\S+? .) --C-> \S+? F --C-> \S+? M --C-> (\S+? F)/g, '외증손녀'],
    [/(\S+? .) --C-> \S+? M --C-> \S+? M --C-> \S+? . .-S-. (\S+? F)/g, '증손자며느리'],
    [/(\S+? .) --C-> \S+? F --C-> \S+? M --C-> \S+? . .-S-. (\S+? M)/g, '증손녀사위'],
    [/(\S+? .) --C-> \S+? F --C-> \S+? M --C-> \S+? . .-S-. (\S+? F)/g, '외증손자며느리'],
    [/(\S+? .) --C-> \S+? M --C-> \S+? M --C-> \S+? . .-S-. (\S+? M)/g, '외증손녀사위'],
    [/(\S+? .) --C-> \S+? M --C-> \S+? M --C-> \S+? M --C-> (\S+? M)/g, '고손자'],
    [/(\S+? .) --C-> \S+? M --C-> \S+? M --C-> \S+? M --C-> (\S+? F)/g, '고손녀'],
    [/(\S+? .) --C-> \S+? M --C-> \S+? M --C-> \S+? M --C-> \S+? M .-S-. (\S+? F)/g, '고손자며느리'],
    [/(\S+? .) --C-> \S+? M --C-> \S+? M --C-> \S+? M --C-> \S+? F .-S-. (\S+? M)/g, '고손녀사위'],
    [/(\S+? .) --C-> \S+? M --C-> \S+? M --C-> \S+? M --C-> \S+? M --C-> (\S+? M)/g, '5대손'],
    [/(\S+? .) --C-> \S+? M --C-> \S+? M --C-> \S+? M --C-> \S+? M --C-> \S+? M --C-> (\S+? M)/g, '6대손'],

    [/(\S+? .) <-C-- (\S+? M)/g, '부친'],
    [/(\S+? .) <-C-- (\S+? F)/g, '모친'],
    [/(\S+? .) <-C-- \S+? M <-C-- (\S+? M)/g, '조부'],
    [/(\S+? .) <-C-- \S+? F <-C-- (\S+? M)/g, '외조부'],
    [/(\S+? .) <-C-- \S+? M <-C-- (\S+? F)/g, '조모'],
    [/(\S+? .) <-C-- \S+? F <-C-- (\S+? F)/g, '외조모'],
    [/(\S+? .) <-C-- \S+? M <-C-- \S+? M <-C-- (\S+? M)/g, '증조부'],
    [/(\S+? .) <-C-- \S+? F <-C-- \S+? M <-C-- (\S+? M)/g, '외증조부'],
    [/(\S+? .) <-C-- \S+? M <-C-- \S+? M <-C-- (\S+? F)/g, '증조모'],
    [/(\S+? .) <-C-- \S+? F <-C-- \S+? M <-C-- (\S+? F)/g, '외증조모'],
    [/(\S+? .) <-C-- \S+? M <-C-- \S+? M <-C-- \S+? M <-C-- (\S+? M)/g, '고조부'],
    [/(\S+? .) <-C-- \S+? F <-C-- \S+? M <-C-- \S+? M <-C-- (\S+? M)/g, '외고조부'],
    [/(\S+? .) <-C-- \S+? M <-C-- \S+? M <-C-- \S+? M <-C-- (\S+? F)/g, '고조모'],
    [/(\S+? .) <-C-- \S+? F <-C-- \S+? M <-C-- \S+? M <-C-- (\S+? F)/g, '외고조모'],
    [/(\S+? .) <-C-- \S+? M <-C-- \S+? M <-C-- \S+? M <-C-- \S+? M <-C-- (\S+? M)/g, '5대조'],
    [/(\S+? .) <-C-- \S+? M <-C-- \S+? M <-C-- \S+? M <-C-- \S+? M <-C-- \S+? M <-C-- (\S+? M)/g, '6대조'],

    [/(\S+? M) .-S-. \S+? . <-C-- \S+? M <-C-- (\S+? M)/g, '처조부'],
    [/(\S+? M) .-S-. \S+? . <-C-- \S+? F <-C-- (\S+? M)/g, '처외조부'],
    [/(\S+? M) .-S-. \S+? . <-C-- \S+? M <-C-- (\S+? F)/g, '처조모'],
    [/(\S+? M) .-S-. \S+? . <-C-- \S+? F <-C-- (\S+? F)/g, '처외조모'],
    [/(\S+? M) .-S-. \S+? . <-C-- \S+? M <-C-- \S+? M <-C-- (\S+? M)/g, '처증조부'],
    [/(\S+? M) .-S-. \S+? . <-C-- \S+? F <-C-- \S+? M <-C-- (\S+? M)/g, '처외증조부'],
    [/(\S+? M) .-S-. \S+? . <-C-- \S+? M <-C-- \S+? M <-C-- (\S+? F)/g, '처증조모'],
    [/(\S+? M) .-S-. \S+? . <-C-- \S+? F <-C-- \S+? M <-C-- (\S+? F)/g, '처외증조모'],

    [/(\S+? F) .-S-. \S+? . <-C-- \S+? M <-C-- (\S+? M)/g, '시조부'],
    [/(\S+? F) .-S-. \S+? . <-C-- \S+? F <-C-- (\S+? M)/g, '시외조부'],
    [/(\S+? F) .-S-. \S+? . <-C-- \S+? M <-C-- (\S+? F)/g, '시조모'],
    [/(\S+? F) .-S-. \S+? . <-C-- \S+? F <-C-- (\S+? F)/g, '시외조모'],
    [/(\S+? F) .-S-. \S+? . <-C-- \S+? M <-C-- \S+? M <-C-- (\S+? M)/g, '시증조부'],
    [/(\S+? F) .-S-. \S+? . <-C-- \S+? F <-C-- \S+? M <-C-- (\S+? M)/g, '시외증조부'],
    [/(\S+? F) .-S-. \S+? . <-C-- \S+? M <-C-- \S+? M <-C-- (\S+? F)/g, '시증조모'],
    [/(\S+? F) .-S-. \S+? . <-C-- \S+? F <-C-- \S+? M <-C-- (\S+? F)/g, '시외증조모'],

    [/(\S+? .) <-C-- \S+? M <-C-- \S+? M --C-> (\S+? M)/g, '백숙부'],
    [/(\S+? .) <-C-- \S+? F <-C-- \S+? M --C-> (\S+? M)/g, '외삼촌'],
    [/(\S+? .) <-C-- \S+? M <-C-- \S+? M --C-> (\S+? F)/g, '고모'],
    [/(\S+? .) <-C-- \S+? F <-C-- \S+? M --C-> (\S+? F)/g, '이모'],
    [/(\S+? .) <-C-- \S+? M <-C-- \S+? M --C-> \S+? M .-S-. (\S+? F)/g, '백숙모'],
    [/(\S+? .) <-C-- \S+? F <-C-- \S+? M --C-> \S+? M .-S-. (\S+? F)/g, '외숙모'],
    [/(\S+? .) <-C-- \S+? M <-C-- \S+? M --C-> \S+? F .-S-. (\S+? M)/g, '고모부'],
    [/(\S+? .) <-C-- \S+? F <-C-- \S+? M --C-> \S+? F .-S-. (\S+? M)/g, '이모부'],

    [/(\S+? M) .-S-. \S+? . <-C-- \S+? M <-C-- \S+? M --C-> (\S+? F)/g, '처고모'],
    [/(\S+? M) .-S-. \S+? . <-C-- \S+? F <-C-- \S+? M --C-> (\S+? F)/g, '처이모'],
    [/(\S+? M) .-S-. \S+? . <-C-- \S+? M <-C-- \S+? M --C-> \S+? F .-S-. (\S+? M)/g, '처고모부'],
    [/(\S+? M) .-S-. \S+? . <-C-- \S+? F <-C-- \S+? M --C-> \S+? F .-S-. (\S+? M)/g, '처이모부'],

    [/(\S+? F) .-S-. \S+? . <-C-- \S+? M <-C-- \S+? M --C-> (\S+? F)/g, '시고모'],
    [/(\S+? F) .-S-. \S+? . <-C-- \S+? F <-C-- \S+? M --C-> (\S+? F)/g, '시이모'],
    [/(\S+? F) .-S-. \S+? . <-C-- \S+? M <-C-- \S+? M --C-> \S+? F .-S-. (\S+? M)/g, '시고모부'],
    [/(\S+? F) .-S-. \S+? . <-C-- \S+? F <-C-- \S+? M --C-> \S+? F .-S-. (\S+? M)/g, '시이모부'],

    [/(\S+? M) <-C-- \S+? M <-C-- \S+? M --C-> \S+? M --C-> (\S+? M)/g, '4촌(종형제)'],
    [/(\S+? M) <-C-- \S+? M <-C-- \S+? M --C-> \S+? M --C-> (\S+? F)/g, '4촌(종남매)'],
    [/(\S+? F) <-C-- \S+? M <-C-- \S+? M --C-> \S+? M --C-> (\S+? M)/g, '4촌(종남매)'],
    [/(\S+? F) <-C-- \S+? M <-C-- \S+? M --C-> \S+? M --C-> (\S+? F)/g, '4촌(종자매)'],

    [/(\S+? M) <-C-- \S+? F <-C-- \S+? M --C-> \S+? M --C-> (\S+? M)/g, '4촌(외종형제)'],
    [/(\S+? M) <-C-- \S+? F <-C-- \S+? M --C-> \S+? M --C-> (\S+? F)/g, '4촌(외종남매)'],
    [/(\S+? F) <-C-- \S+? F <-C-- \S+? M --C-> \S+? M --C-> (\S+? M)/g, '4촌(외종남매)'],
    [/(\S+? F) <-C-- \S+? F <-C-- \S+? M --C-> \S+? M --C-> (\S+? F)/g, '4촌(외종자매)'],

    [/(\S+? M) <-C-- \S+? M <-C-- \S+? M --C-> \S+? F --C-> (\S+? M)/g, '4촌(내종형제)'],
    [/(\S+? M) <-C-- \S+? M <-C-- \S+? M --C-> \S+? F --C-> (\S+? F)/g, '4촌(내종남매)'],
    [/(\S+? F) <-C-- \S+? M <-C-- \S+? M --C-> \S+? F --C-> (\S+? M)/g, '4촌(내종남매)'],
    [/(\S+? F) <-C-- \S+? M <-C-- \S+? M --C-> \S+? F --C-> (\S+? F)/g, '4촌(내종자매)'],

    [/(\S+? M) <-C-- \S+? F <-C-- \S+? M --C-> \S+? F --C-> (\S+? M)/g, '4촌(이종형제)'],
    [/(\S+? M) <-C-- \S+? F <-C-- \S+? M --C-> \S+? F --C-> (\S+? F)/g, '4촌(이종남매)'],
    [/(\S+? F) <-C-- \S+? F <-C-- \S+? M --C-> \S+? F --C-> (\S+? M)/g, '4촌(이종남매)'],
    [/(\S+? F) <-C-- \S+? F <-C-- \S+? M --C-> \S+? F --C-> (\S+? F)/g, '4촌(이종자매)'],

    [/(\S+? .) <-C-- \S+? M <-C-- \S+? M <-C-- \S+? M --C-> \S+? M --C-> (\S+? M)/g, '5촌(당숙)'],
    [/(\S+? .) <-C-- \S+? M <-C-- \S+? M <-C-- \S+? M --C-> \S+? M --C-> (\S+? F)/g, '5촌(당고모)'],
    [/(\S+? .) <-C-- \S+? F <-C-- \S+? M <-C-- \S+? M --C-> \S+? M --C-> (\S+? M)/g, '5촌(외당숙)'],
    [/(\S+? .) <-C-- \S+? F <-C-- \S+? M <-C-- \S+? M --C-> \S+? M --C-> (\S+? F)/g, '5촌(당이모)'],
]


// Greedy search and replace (try the longest pattern first)
rules.sort(function(a, b) {return b[0].source.length - a[0].source.length})


window.kinship = function(s) {
  // Apply shortening rules
  var prev2 =  null
  var cur = s
  while(prev2 !== cur) {
    prev2 = cur
    for(var i = 0; i < rules.length; i++) {
      var p = rules[i][0]
      var str = rules[i][1]
      var prev1 = null
      while(prev1 !== cur) {
        prev1 = cur
        cur = cur.replace(p, '$1의 ' + str + ' $2')
      }
    }
  }

  // Remove gender postfixes
  cur = cur.replace(/ [MF]/g, '')

  return cur
}


})()
